package com.whatever.raisedragon.common.exception

enum class ExceptionCode(
    val httpStatusCode: Int,
    val message: String,
) {

    E400_BAD_REQUEST( 400, "필수 파라미터 값이 없거나 잘못된 값으로 요청을 보낸 경우 발생"),

    // ------------------------------ 401 ------------------------------
    E401_UNAUTHORIZED(401, "유효하지 않은 인증 토큰을 사용한 경우 발생"),

    // ------------------------------ 403 ------------------------------
    E403_FORBIDDEN(403, "사용 권한이 없는 경우 발생"),

    // ------------------------------ 404 ------------------------------
    E404_NOT_FOUND(404, "요청한 리소스가 존재하지 않는 경우 발생"),

    // ------------------------------ 405 ------------------------------
    E405_METHOD_NOT_ALLOWED(405, "HTTP Method가 잘못된 경우"),

    // ------------------------------ 409 ------------------------------
    E409_CONFLICT(409, "요청한 리소스가 중복된 경우 발생"),

    // ------------------------------ 500 ------------------------------
    E500_INTERNAL_SERVER_ERROR(500, "서버 내부에 문제 발생"),

    // ------------------------------ 501 ------------------------------
    E501_NOT_IMPLEMENTED(501, "지원하지 않는 타입의 요청");

    val errorCode: String
        get() = httpStatusCode.toString()
}
